Revit 2026 API

# Category Methods

---

The Category type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Causes the object to release immediately any resources it may be utilizing.(Inherited from APIObject) |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetBuiltInCategory | Gets the BuiltInCategory value corresponding to the given built-in category identifier. |
|  | GetBuiltInCategoryTypeId | Gets the ForgeTypeId identifying the given built-in category. |
|  | GetCategory(Document, BuiltInCategory) | Retrieves a category object corresponding to a BuiltInCategory id. |
|  | GetCategory(Document, ElementId) | Retrieves a category object corresponding to the category id. |
|  | GetGraphicsStyle | Gets the graphics style associated with this category for the given graphics style type. |
|  | GetHashCode | (Overrides ObjectGetHashCode) |
|  | GetLinePatternId | Gets the line pattern id associated with this category for the given graphics style type. |
|  | GetLineWeight | Retrieves the line weight assigned to the category for the given graphics style type. |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | IsBuiltInCategory | Checks whether a ForgeTypeId identifies a built-in category. |
|  | IsBuiltInCategoryValid | Checks if a Category exists for a given BuiltInCategory. |
|  | SetLinePatternId | Sets the line pattern id associated with this category for the given graphics style type. |
|  | SetLineWeight | Sets the line weight for the given graphics style type. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Category Class

Autodesk.Revit.DB Namespace